# Напишите программу для печати всех уникальных значений в словаре
# [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},
# {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII":" S007 "}] 

n=[{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},{"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII":" S007 "}] 
x=set()
for item in n:
    for value in item.values():
        x.add(value.strip())   #strip убирает пробелы и лишние знаки

print(x)

